{
  "tense": "past-perfect",
  "packs": [
    {
      "id": "past-perfect-beginner",
      "level": "beginner",
      "levelName": "Beginner",
      "description": "Actions completed before another past action",
      "sentences": [
        { "urdu": "جب میں پہنچی، وہ جا چکا تھا", "english": "When I arrived, he had left." },
        { "urdu": "میں نے کھانا کھا لیا تھا جب وہ آیا", "english": "I had eaten when he came." },
        { "urdu": "ٹرین جا چکی تھی جب ہم سٹیشن پہنچے", "english": "The train had left when we reached the station." },
        { "urdu": "وہ سو چکی تھی جب میں نے فون کیا", "english": "She had slept when I called." },
        { "urdu": "بارش رک چکی تھی جب ہم باہر نکلے", "english": "The rain had stopped when we went outside." },
        { "urdu": "میں نے پہلے کبھی یہ نہیں دیکھا تھا", "english": "I had never seen this before." },
        { "urdu": "وہ یہ فلم پہلے دیکھ چکا تھا", "english": "He had watched this movie before." },
        { "urdu": "ہم نے کام ختم کر لیا تھا جب باس آیا", "english": "We had finished the work when the boss came." },
        { "urdu": "میں نے ناشتہ کر لیا تھا جب تم نے بلایا", "english": "I had had breakfast when you called." },
        { "urdu": "وہ چلا گیا تھا جب میں نے دیکھا", "english": "He had gone when I looked." },
        { "urdu": "بچے سو چکے تھے جب ابا گھر آئے", "english": "The children had slept when father came home." },
        { "urdu": "میں نے یہ کتاب پہلے پڑھی تھی", "english": "I had read this book before." },
        { "urdu": "وہ تیار ہو چکی تھی جب میں پہنچی", "english": "She had got ready when I arrived." },
        { "urdu": "ہم کھانا کھا چکے تھے جب مہمان آئے", "english": "We had eaten when the guests arrived." },
        { "urdu": "فلم شروع ہو چکی تھی جب ہم پہنچے", "english": "The movie had started when we arrived." },
        { "urdu": "میں یہ بات بھول چکی تھی", "english": "I had forgotten this." },
        { "urdu": "وہ کام ختم کر چکا تھا", "english": "He had finished the work." },
        { "urdu": "بارش ہو چکی تھی", "english": "It had rained." },
        { "urdu": "میں نے پہلے کبھی یہاں نہیں آیا تھا", "english": "I had never come here before." },
        { "urdu": "وہ مجھے بتا چکا تھا", "english": "He had told me." },
        { "urdu": "دکان بند ہو چکی تھی جب میں گئی", "english": "The shop had closed when I went." },
        { "urdu": "میں نے خط بھیج دیا تھا", "english": "I had sent the letter." },
        { "urdu": "وہ روانہ ہو چکے تھے", "english": "They had departed." },
        { "urdu": "میں نے یہ سن لیا تھا", "english": "I had heard this." },
        { "urdu": "بچہ سو گیا تھا", "english": "The child had fallen asleep." },
        { "urdu": "میں نے فیصلہ کر لیا تھا", "english": "I had decided." },
        { "urdu": "وہ تھک چکا تھا", "english": "He had got tired." },
        { "urdu": "ہم مل چکے تھے", "english": "We had met." },
        { "urdu": "میں نے سب کچھ سمجھ لیا تھا", "english": "I had understood everything." },
        { "urdu": "وہ چلی گئی تھی", "english": "She had left." }
      ]
    },
    {
      "id": "past-perfect-medium",
      "level": "medium",
      "levelName": "Medium",
      "description": "Sequences of past events and reported speech",
      "sentences": [
        { "urdu": "اس نے کہا کہ وہ یہ کام کر چکا ہے", "english": "He said that he had done this work." },
        { "urdu": "مجھے بتایا گیا کہ وہ چلی گئی تھی", "english": "I was told that she had left." },
        { "urdu": "جب میں نے دروازہ کھولا، وہ جا چکا تھا", "english": "When I opened the door, he had already gone." },
        { "urdu": "اس نے بتایا کہ اس نے پہلے کبھی یہ نہیں کیا تھا", "english": "She told that she had never done this before." },
        { "urdu": "جب تک ہم فیصلہ کرتے، موقع جا چکا تھا", "english": "By the time we decided, the opportunity had gone." },
        { "urdu": "مجھے نہیں معلوم تھا کہ وہ شادی شدہ ہے", "english": "I did not know that he had been married." },
        { "urdu": "اس نے سوچا کہ میں غلط تھی", "english": "She thought that I had been wrong." },
        { "urdu": "جب میں واپس آئی، سب کچھ بدل چکا تھا", "english": "When I came back, everything had changed." },
        { "urdu": "اس نے پوچھا کہ میں کہاں گئی تھی", "english": "He asked where I had gone." },
        { "urdu": "مجھے احساس ہوا کہ میں غلطی کر چکی ہوں", "english": "I realized that I had made a mistake." },
        { "urdu": "جب وہ آیا، میں کھانا بنا چکی تھی", "english": "When he came, I had cooked the food." },
        { "urdu": "اس نے بتایا کہ وہ کل میرے گھر آیا تھا", "english": "He told that he had come to my house yesterday." },
        { "urdu": "جب تک ڈاکٹر آیا، مریض ٹھیک ہو چکا تھا", "english": "By the time the doctor came, the patient had recovered." },
        { "urdu": "میں نے سنا تھا کہ وہ بہت اچھی گاتی ہے", "english": "I had heard that she sang very well." },
        { "urdu": "جب سورج نکلا، ہم راستے میں تھے", "english": "When the sun rose, we had already been on the way." },
        { "urdu": "اس نے کہا کہ اس نے میرا پیغام نہیں پڑھا تھا", "english": "She said that she had not read my message." },
        { "urdu": "جب میں نے جاننا چاہا، وہ بتا چکی تھی", "english": "When I wanted to know, she had already told." },
        { "urdu": "مجھے یقین تھا کہ میں نے صحیح فیصلہ کیا ہے", "english": "I was sure that I had made the right decision." },
        { "urdu": "جب بجلی آئی، فلم ختم ہو چکی تھی", "english": "When the power came, the movie had finished." },
        { "urdu": "اس نے پوچھا کہ کیا میں نے کھانا کھایا تھا", "english": "She asked if I had eaten." },
        { "urdu": "جب میں اٹھی، سب جا چکے تھے", "english": "When I woke up, everyone had left." },
        { "urdu": "مجھے معلوم نہیں تھا کہ وہ اتنا ذہین ہے", "english": "I had not known that he was so intelligent." },
        { "urdu": "جب وہ پہنچی، میں نے تیاری کر لی تھی", "english": "When she arrived, I had prepared." },
        { "urdu": "اس نے بتایا کہ اس کی طبیعت خراب تھی", "english": "He told that he had been unwell." },
        { "urdu": "جب تک امتحان شروع ہوا، میں نے پڑھ لیا تھا", "english": "By the time the exam started, I had studied." },
        { "urdu": "میں نے محسوس کیا کہ کچھ غلط ہو چکا ہے", "english": "I felt that something had gone wrong." },
        { "urdu": "جب پولیس آئی، چور بھاگ چکا تھا", "english": "When the police came, the thief had escaped." },
        { "urdu": "اس نے کہا کہ اس نے میری مدد کی تھی", "english": "She said that she had helped me." },
        { "urdu": "جب میں نے فون کیا، وہ سو چکی تھی", "english": "When I called, she had already slept." },
        { "urdu": "مجھے یاد آیا کہ میں دوا لینا بھول گئی تھی", "english": "I remembered that I had forgotten to take the medicine." }
      ]
    },
    {
      "id": "past-perfect-advanced",
      "level": "advanced",
      "levelName": "Advanced",
      "description": "Complex past narratives and hypothetical past",
      "sentences": [
        { "urdu": "اگر میں نے پہلے سوچا ہوتا تو یہ غلطی نہ ہوتی", "english": "If I had thought earlier, this mistake would not have happened." },
        { "urdu": "کاش میں نے اس کی بات سنی ہوتی", "english": "I wish I had listened to her." },
        { "urdu": "اس نے محسوس کیا کہ اس نے اپنی زندگی کا سب سے بڑا موقع کھو دیا تھا", "english": "He felt that he had lost the biggest opportunity of his life." },
        { "urdu": "جب سب کچھ ختم ہو گیا، تب مجھے سمجھ آئی کہ کیا ہوا تھا", "english": "When everything was over, I understood what had happened." },
        { "urdu": "اگر تم نے مجھے بتایا ہوتا تو میں ضرور آتی", "english": "If you had told me, I would definitely have come." },
        { "urdu": "وہ سب کچھ بھول چکی تھی جو ہم نے ساتھ گزارا تھا", "english": "She had forgotten everything we had spent together." },
        { "urdu": "مجھے احساس ہوا کہ میں نے کتنا قیمتی وقت ضائع کر دیا تھا", "english": "I realized how much precious time I had wasted." },
        { "urdu": "اگر میں نے زیادہ محنت کی ہوتی تو کامیاب ہو جاتی", "english": "If I had worked harder, I would have succeeded." },
        { "urdu": "جب میں نے سچائی جانی، بہت دیر ہو چکی تھی", "english": "When I learned the truth, it had been too late." },
        { "urdu": "کاش ہم نے یہ فیصلہ نہ کیا ہوتا", "english": "I wish we had not made this decision." },
        { "urdu": "وہ سوچ رہا تھا کہ اس کی زندگی کیسے بدل گئی تھی", "english": "He was thinking about how his life had changed." },
        { "urdu": "اگر بارش نہ ہوئی ہوتی تو ہم پکنک پر جاتے", "english": "If it had not rained, we would have gone for a picnic." },
        { "urdu": "جب تک میں نے جواب دیا، وہ چلا گیا تھا", "english": "By the time I answered, he had gone." },
        { "urdu": "مجھے معلوم ہوا کہ وہ برسوں پہلے یہاں رہ چکی تھی", "english": "I found out that she had lived here years ago." },
        { "urdu": "اگر اس نے پوچھا ہوتا تو میں بتا دیتی", "english": "If she had asked, I would have told her." },
        { "urdu": "جب میں واپس آئی، سب کچھ وہاں تھا جہاں میں نے چھوڑا تھا", "english": "When I came back, everything was where I had left it." },
        { "urdu": "وہ سوچ رہی تھی کہ اس نے کیا غلط کیا تھا", "english": "She was thinking what she had done wrong." },
        { "urdu": "اگر ہم نے ٹکٹ پہلے خریدے ہوتے تو سیٹیں مل جاتیں", "english": "If we had bought tickets earlier, we would have got seats." },
        { "urdu": "جب سب ختم ہوا، میں نے محسوس کیا کہ کتنا کچھ بدل چکا تھا", "english": "When everything ended, I felt how much had changed." },
        { "urdu": "کاش میں اس سے مل لیتی جب وہ زندہ تھا", "english": "I wish I had met him when he was alive." },
        { "urdu": "اس نے جان لیا تھا کہ اس کے ساتھ کیا ہونے والا ہے", "english": "He had known what was going to happen to him." },
        { "urdu": "اگر میں نے یہ موقع نہیں کھویا ہوتا تو آج کہاں ہوتی", "english": "If I had not lost this opportunity, where would I be today." },
        { "urdu": "جب میں نے دروازہ کھولا، میں نے دیکھا کہ کوئی آ چکا تھا", "english": "When I opened the door, I saw that someone had come." },
        { "urdu": "وہ بتا رہی تھی کہ اس کی زندگی کیسے بدل گئی تھی", "english": "She was telling how her life had changed." },
        { "urdu": "اگر ہم نے پہلے شروع کیا ہوتا تو اب تک ختم کر چکے ہوتے", "english": "If we had started earlier, we would have finished by now." },
        { "urdu": "مجھے پتا چلا کہ وہ وہی شخص تھا جس سے میں بچپن میں ملی تھی", "english": "I found out that he was the same person I had met in childhood." },
        { "urdu": "کاش میں نے اس کی بات سنجیدگی سے لی ہوتی", "english": "I wish I had taken her words seriously." },
        { "urdu": "جب سچائی سامنے آئی، سب حیران تھے کہ کیا ہو چکا تھا", "english": "When the truth came out, everyone was surprised at what had happened." },
        { "urdu": "اگر وہ نہ آیا ہوتا تو کیا ہوتا", "english": "What would have happened if he had not come." },
        { "urdu": "میں نے سوچا کہ میں نے صحیح راستہ چنا تھا یا غلط", "english": "I thought whether I had chosen the right path or wrong." }
      ]
    }
  ]
}
