{
  "tense": "past-continuous",
  "packs": [
    {
      "id": "past-continuous-beginner",
      "level": "beginner",
      "levelName": "Beginner",
      "description": "Actions in progress at a past moment",
      "sentences": [
        { "urdu": "میں کھانا پکا رہی تھی", "english": "I was cooking food." },
        { "urdu": "وہ ٹی وی دیکھ رہا تھا", "english": "He was watching TV." },
        { "urdu": "بچے کھیل رہے تھے", "english": "The children were playing." },
        { "urdu": "میں پڑھ رہی تھی", "english": "I was studying." },
        { "urdu": "وہ سو رہی تھی", "english": "She was sleeping." },
        { "urdu": "ہم انتظار کر رہے تھے", "english": "We were waiting." },
        { "urdu": "بارش ہو رہی تھی", "english": "It was raining." },
        { "urdu": "وہ کام کر رہا تھا", "english": "He was working." },
        { "urdu": "میں چائے بنا رہی تھی", "english": "I was making tea." },
        { "urdu": "وہ لکھ رہی تھی", "english": "She was writing." },
        { "urdu": "بچہ رو رہا تھا", "english": "The baby was crying." },
        { "urdu": "میں سن رہی تھی", "english": "I was listening." },
        { "urdu": "وہ گانا گا رہا تھا", "english": "He was singing." },
        { "urdu": "ہم چل رہے تھے", "english": "We were walking." },
        { "urdu": "وہ پانی پی رہی تھی", "english": "She was drinking water." },
        { "urdu": "میں کپڑے دھو رہی تھی", "english": "I was washing clothes." },
        { "urdu": "وہ کتاب پڑھ رہا تھا", "english": "He was reading a book." },
        { "urdu": "بچے دوڑ رہے تھے", "english": "The children were running." },
        { "urdu": "میں صفائی کر رہی تھی", "english": "I was cleaning." },
        { "urdu": "وہ بات کر رہے تھے", "english": "They were talking." },
        { "urdu": "میں سوچ رہی تھی", "english": "I was thinking." },
        { "urdu": "وہ مسکرا رہی تھی", "english": "She was smiling." },
        { "urdu": "ہم کھانا کھا رہے تھے", "english": "We were eating food." },
        { "urdu": "وہ فون پر بات کر رہا تھا", "english": "He was talking on the phone." },
        { "urdu": "میں جا رہی تھی", "english": "I was going." },
        { "urdu": "وہ آ رہا تھا", "english": "He was coming." },
        { "urdu": "بچے ہوم ورک کر رہے تھے", "english": "The children were doing homework." },
        { "urdu": "میں ناشتہ تیار کر رہی تھی", "english": "I was preparing breakfast." },
        { "urdu": "وہ دیکھ رہی تھی", "english": "She was watching." },
        { "urdu": "ہم بیٹھے ہوئے تھے", "english": "We were sitting." }
      ]
    },
    {
      "id": "past-continuous-medium",
      "level": "medium",
      "levelName": "Medium",
      "description": "Interrupted actions and parallel events",
      "sentences": [
        { "urdu": "جب فون بجا، میں نہا رہی تھی", "english": "When the phone rang, I was taking a bath." },
        { "urdu": "جب وہ آیا، ہم کھانا کھا رہے تھے", "english": "When he came, we were eating." },
        { "urdu": "کل رات آٹھ بجے میں پڑھ رہی تھی", "english": "I was studying at eight o'clock last night." },
        { "urdu": "جب بجلی گئی، بچے ٹی وی دیکھ رہے تھے", "english": "When the power went out, the children were watching TV." },
        { "urdu": "جب میں گھر پہنچی، سب سو رہے تھے", "english": "When I reached home, everyone was sleeping." },
        { "urdu": "وہ کیا کر رہا تھا جب تم نے اسے دیکھا؟", "english": "What was he doing when you saw him?" },
        { "urdu": "میں کھڑکی سے باہر دیکھ رہی تھی جب حادثہ ہوا", "english": "I was looking out the window when the accident happened." },
        { "urdu": "جب ماں نے پکارا، میں کھیل رہی تھی", "english": "When mother called, I was playing." },
        { "urdu": "سارا دن بارش ہو رہی تھی", "english": "It was raining all day." },
        { "urdu": "جب میں نے دیکھا، وہ رو رہی تھی", "english": "When I saw, she was crying." },
        { "urdu": "ہم گھر جا رہے تھے جب ٹریفک جام ہو گیا", "english": "We were going home when traffic got jammed." },
        { "urdu": "کیا تم سو رہی تھی جب میں نے فون کیا؟", "english": "Were you sleeping when I called?" },
        { "urdu": "وہ کچھ ڈھونڈ رہا تھا جب میں نے پوچھا", "english": "He was looking for something when I asked." },
        { "urdu": "جب میں اندر آئی، وہ ٹی وی بند کر رہا تھا", "english": "When I came in, he was turning off the TV." },
        { "urdu": "بچے پارک میں کھیل رہے تھے جب بارش شروع ہوئی", "english": "The children were playing in the park when it started raining." },
        { "urdu": "میں ناشتہ بنا رہی تھی جب مہمان آ گئے", "english": "I was making breakfast when the guests arrived." },
        { "urdu": "جب گھنٹی بجی، استاد پڑھا رہے تھے", "english": "When the bell rang, the teacher was teaching." },
        { "urdu": "وہ سب کچھ سن رہا تھا لیکن بول نہیں رہا تھا", "english": "He was listening to everything but not speaking." },
        { "urdu": "کیا بارش ہو رہی تھی جب تم باہر گئی؟", "english": "Was it raining when you went outside?" },
        { "urdu": "میں انتظار کر رہی تھی جب اعلان ہوا", "english": "I was waiting when the announcement was made." },
        { "urdu": "جب ڈاکیا آیا، میں صحن میں کام کر رہی تھی", "english": "When the postman came, I was working in the yard." },
        { "urdu": "وہ ہنس رہی تھی جب میں نے اسے دیکھا", "english": "She was laughing when I saw her." },
        { "urdu": "جب میں کمرے میں داخل ہوئی، وہ فون پر بات کر رہے تھے", "english": "When I entered the room, they were talking on the phone." },
        { "urdu": "بچہ سو رہا تھا جب شور ہوا", "english": "The baby was sleeping when the noise happened." },
        { "urdu": "کیا تم مجھے ڈھونڈ رہی تھی؟", "english": "Were you looking for me?" },
        { "urdu": "ہم چائے پی رہے تھے جب بجلی چلی گئی", "english": "We were drinking tea when the electricity went out." },
        { "urdu": "جب میں نے واپس دیکھا، وہ جا رہا تھا", "english": "When I looked back, he was leaving." },
        { "urdu": "وہ بہت تیز بول رہی تھی", "english": "She was speaking very fast." },
        { "urdu": "جب دروازہ کھلا، کتا بھونک رہا تھا", "english": "When the door opened, the dog was barking." },
        { "urdu": "میں خواب دیکھ رہی تھی جب الارم بجا", "english": "I was dreaming when the alarm rang." }
      ]
    },
    {
      "id": "past-continuous-advanced",
      "level": "advanced",
      "levelName": "Advanced",
      "description": "Parallel actions, atmosphere, and complex narratives",
      "sentences": [
        { "urdu": "جب میں پکا رہی تھی، بچے کھیل رہے تھے اور میرے شوہر آرام کر رہے تھے", "english": "While I was cooking, the children were playing and my husband was resting." },
        { "urdu": "پرندے چہچہا رہے تھے، سورج نکل رہا تھا اور ہوا چل رہی تھی", "english": "Birds were chirping, the sun was rising, and the wind was blowing." },
        { "urdu": "میں سوچ رہی تھی کہ وہ کیا کر رہا ہوگا", "english": "I was thinking what he must be doing." },
        { "urdu": "جب سب ناشتہ کر رہے تھے، میں تیاری کر رہی تھی", "english": "While everyone was having breakfast, I was getting ready." },
        { "urdu": "وہ مجھے گھور رہا تھا جیسے میں نے کچھ غلط کیا ہو", "english": "He was staring at me as if I had done something wrong." },
        { "urdu": "بارش تیز ہو رہی تھی اور ہم بھیگ رہے تھے", "english": "The rain was getting heavier and we were getting wet." },
        { "urdu": "وہ مسلسل شکایت کر رہی تھی جب کہ کوئی نہیں سن رہا تھا", "english": "She was constantly complaining while no one was listening." },
        { "urdu": "جب میں باہر نکل رہی تھی، کوئی دروازے پر دستک دے رہا تھا", "english": "As I was going out, someone was knocking on the door." },
        { "urdu": "وہ جھوٹ بول رہا تھا اور مجھے پتا تھا", "english": "He was lying and I knew it." },
        { "urdu": "دنیا بدل رہی تھی لیکن وہ وہی پرانی باتیں کر رہا تھا", "english": "The world was changing but he was saying the same old things." },
        { "urdu": "میں پریشان ہو رہی تھی کیونکہ وہ جواب نہیں دے رہا تھا", "english": "I was getting worried because he was not answering." },
        { "urdu": "جب وہ بول رہی تھی، میں اس کے چہرے کے تاثرات دیکھ رہی تھی", "english": "While she was speaking, I was observing her facial expressions." },
        { "urdu": "ہم سوچ رہے تھے کہ آگے کیا ہونے والا ہے", "english": "We were thinking about what was going to happen next." },
        { "urdu": "بچے اوپر شور مچا رہے تھے جب کہ مہمان نیچے بیٹھے تھے", "english": "The children were making noise upstairs while the guests were sitting downstairs." },
        { "urdu": "میں انتظار کر رہی تھی اور گھڑی کی طرف دیکھ رہی تھی", "english": "I was waiting and looking at the clock." },
        { "urdu": "وہ جاتے جاتے مڑ کر دیکھ رہا تھا", "english": "He was looking back while leaving." },
        { "urdu": "آسمان پر بادل جمع ہو رہے تھے اور ٹھنڈی ہوا چل رہی تھی", "english": "Clouds were gathering in the sky and a cold wind was blowing." },
        { "urdu": "جب میں سوچ رہی تھی، اس نے اچانک پوچھ لیا", "english": "While I was thinking, he suddenly asked." },
        { "urdu": "وہ اپنی کہانی سنا رہی تھی اور سب سن رہے تھے", "english": "She was telling her story and everyone was listening." },
        { "urdu": "مجھے یقین نہیں ہو رہا تھا کہ یہ سب ہو رہا ہے", "english": "I was not believing that all this was happening." },
        { "urdu": "جب ہم روانہ ہو رہے تھے، ماں دعائیں دے رہی تھی", "english": "When we were departing, mother was praying for us." },
        { "urdu": "وہ خاموشی سے رو رہی تھی جب کہ کوئی نہیں جان رہا تھا", "english": "She was crying silently while no one was noticing." },
        { "urdu": "حالات خراب ہو رہے تھے اور لوگ پریشان ہو رہے تھے", "english": "The situation was getting worse and people were getting worried." },
        { "urdu": "میں اپنے آپ سے کہہ رہی تھی کہ سب ٹھیک ہو جائے گا", "english": "I was telling myself that everything would be fine." },
        { "urdu": "جب سورج ڈوب رہا تھا، ہم گھر کی طرف جا رہے تھے", "english": "As the sun was setting, we were heading home." },
        { "urdu": "وہ میری طرف دیکھ رہی تھی جیسے کچھ کہنا چاہ رہی ہو", "english": "She was looking at me as if she wanted to say something." },
        { "urdu": "دکان بند ہو رہی تھی جب ہم پہنچے", "english": "The shop was closing when we arrived." },
        { "urdu": "میں خود سے سوال کر رہی تھی کہ میں نے غلط کیا کیا", "english": "I was asking myself what I did wrong." },
        { "urdu": "جب کہانی ختم ہو رہی تھی، بچے سو رہے تھے", "english": "As the story was ending, the children were falling asleep." },
        { "urdu": "زندگی بہت تیزی سے گزر رہی تھی اور میں محسوس کر رہی تھی", "english": "Life was passing very quickly and I was feeling it." }
      ]
    }
  ]
}
