{
  "tense": "present-perfect-continuous",
  "packs": [
    {
      "id": "present-perfect-continuous-beginner",
      "level": "beginner",
      "levelName": "Beginner",
      "description": "Actions continuing from past to now",
      "sentences": [
        { "urdu": "میں ایک گھنٹے سے پڑھ رہی ہوں", "english": "I have been studying for an hour." },
        { "urdu": "وہ صبح سے کام کر رہا ہے", "english": "He has been working since morning." },
        { "urdu": "بارش دو گھنٹے سے ہو رہی ہے", "english": "It has been raining for two hours." },
        { "urdu": "ہم ایک گھنٹے سے انتظار کر رہے ہیں", "english": "We have been waiting for an hour." },
        { "urdu": "وہ تین سال سے یہاں رہ رہی ہے", "english": "She has been living here for three years." },
        { "urdu": "میں پندرہ منٹ سے فون پر بات کر رہی ہوں", "english": "I have been talking on the phone for fifteen minutes." },
        { "urdu": "بچے دو گھنٹے سے کھیل رہے ہیں", "english": "The children have been playing for two hours." },
        { "urdu": "وہ صبح سے سو رہا ہے", "english": "He has been sleeping since morning." },
        { "urdu": "میں آدھے گھنٹے سے کھانا پکا رہی ہوں", "english": "I have been cooking for half an hour." },
        { "urdu": "وہ پانچ سال سے انگریزی پڑھا رہی ہے", "english": "She has been teaching English for five years." },
        { "urdu": "ہم ایک ہفتے سے یہ کام کر رہے ہیں", "english": "We have been doing this work for a week." },
        { "urdu": "میں صبح سے صفائی کر رہی ہوں", "english": "I have been cleaning since morning." },
        { "urdu": "وہ دو گھنٹے سے ڈرائیونگ کر رہا ہے", "english": "He has been driving for two hours." },
        { "urdu": "بچہ آدھے گھنٹے سے رو رہا ہے", "english": "The baby has been crying for half an hour." },
        { "urdu": "میں سویرے سے کام کر رہی ہوں", "english": "I have been working since early morning." },
        { "urdu": "وہ دس منٹ سے فون پر ہے", "english": "She has been on the phone for ten minutes." },
        { "urdu": "ہم ایک گھنٹے سے بات کر رہے ہیں", "english": "We have been talking for an hour." },
        { "urdu": "میں پچھلے ہفتے سے بیمار ہوں", "english": "I have been sick since last week." },
        { "urdu": "وہ دو سال سے یہ نوکری کر رہا ہے", "english": "He has been doing this job for two years." },
        { "urdu": "بارش صبح سے ہو رہی ہے", "english": "It has been raining since morning." },
        { "urdu": "میں آدھے گھنٹے سے تمہارا انتظار کر رہی ہوں", "english": "I have been waiting for you for half an hour." },
        { "urdu": "وہ ایک گھنٹے سے پڑھ رہی ہے", "english": "She has been reading for an hour." },
        { "urdu": "ہم سال بھر سے اس پروجیکٹ پر کام کر رہے ہیں", "english": "We have been working on this project for a year." },
        { "urdu": "میں تین دن سے آرام کر رہی ہوں", "english": "I have been resting for three days." },
        { "urdu": "وہ دو ہفتے سے ورزش کر رہا ہے", "english": "He has been exercising for two weeks." },
        { "urdu": "بچے دوپہر سے ٹی وی دیکھ رہے ہیں", "english": "The children have been watching TV since afternoon." },
        { "urdu": "میں ایک ماہ سے ڈائیٹ کر رہی ہوں", "english": "I have been dieting for a month." },
        { "urdu": "وہ چار سال سے یہاں پڑھ رہا ہے", "english": "He has been studying here for four years." },
        { "urdu": "ہم دو گھنٹے سے سفر کر رہے ہیں", "english": "We have been travelling for two hours." },
        { "urdu": "میں کئی دنوں سے اس کے بارے میں سوچ رہی ہوں", "english": "I have been thinking about this for several days." }
      ]
    },
    {
      "id": "present-perfect-continuous-medium",
      "level": "medium",
      "levelName": "Medium",
      "description": "Emphasis on duration and recent continuous actions",
      "sentences": [
        { "urdu": "تم کتنی دیر سے یہاں بیٹھی ہو؟", "english": "How long have you been sitting here?" },
        { "urdu": "وہ صبح سے کچھ نہیں کھا رہی", "english": "She has not been eating anything since morning." },
        { "urdu": "کیا تم مجھے ڈھونڈ رہی تھی؟ میں یہیں ہوں", "english": "Have you been looking for me? I am right here." },
        { "urdu": "میں پچھلے کئی دنوں سے اچھا محسوس نہیں کر رہی", "english": "I have not been feeling well for the past few days." },
        { "urdu": "وہ کب سے یہ کام کر رہے ہیں؟", "english": "How long have they been doing this work?" },
        { "urdu": "میں تمہیں بتانے کی کوشش کر رہی ہوں", "english": "I have been trying to tell you." },
        { "urdu": "وہ پچھلے ہفتے سے دفتر نہیں آ رہا", "english": "He has not been coming to office since last week." },
        { "urdu": "ہم کافی دیر سے اس مسئلے پر بات کر رہے ہیں", "english": "We have been discussing this issue for quite a while." },
        { "urdu": "کیا بارش ابھی بھی ہو رہی ہے؟", "english": "Has it still been raining?" },
        { "urdu": "میں آج صبح سے فون کرنے کی کوشش کر رہی ہوں", "english": "I have been trying to call since this morning." },
        { "urdu": "وہ پچھلے کئی مہینوں سے نوکری ڈھونڈ رہا ہے", "english": "He has been looking for a job for several months." },
        { "urdu": "بچے سارا دن شور مچا رہے ہیں", "english": "The children have been making noise all day." },
        { "urdu": "کیا تم بھی یہی سوچ رہی ہو جو میں سوچ رہی ہوں؟", "english": "Have you been thinking what I have been thinking?" },
        { "urdu": "میں کافی عرصے سے یہ کورس کر رہی ہوں", "english": "I have been doing this course for quite some time." },
        { "urdu": "وہ صبح سے مسلسل شکایت کر رہی ہے", "english": "She has been complaining constantly since morning." },
        { "urdu": "تم کتنے عرصے سے انگریزی سیکھ رہی ہو؟", "english": "How long have you been learning English?" },
        { "urdu": "ہم کئی سالوں سے اس مسئلے کا سامنا کر رہے ہیں", "english": "We have been facing this problem for many years." },
        { "urdu": "میں پچھلے ہفتے سے اس کا جواب ڈھونڈ رہی ہوں", "english": "I have been looking for its answer since last week." },
        { "urdu": "وہ کب سے میری بات نہیں سن رہا", "english": "How long has he not been listening to me?" },
        { "urdu": "بارش رکنے کا نام نہیں لے رہی", "english": "The rain has not been stopping." },
        { "urdu": "میں کافی دیر سے اسی چیز کے بارے میں سوچ رہی ہوں", "english": "I have been thinking about the same thing for a while." },
        { "urdu": "وہ پچھلے ایک سال سے یہاں نہیں آیا", "english": "He has not been coming here for the past year." },
        { "urdu": "ہم کتنی دیر سے گاڑی میں ہیں؟", "english": "How long have we been in the car?" },
        { "urdu": "میں تم سے ملنے کی کوشش کر رہی تھی", "english": "I have been trying to meet you." },
        { "urdu": "وہ صبح سے کمرے میں بند ہے", "english": "She has been locked in the room since morning." },
        { "urdu": "کیا وہ ٹھیک سے کھا رہا ہے؟", "english": "Has he been eating properly?" },
        { "urdu": "میں کئی راتوں سے اچھی نیند نہیں لے پائی", "english": "I have not been sleeping well for several nights." },
        { "urdu": "ہم اس پروگرام کی تیاری کر رہے ہیں", "english": "We have been preparing for this program." },
        { "urdu": "وہ کتنے دن سے غائب ہے؟", "english": "How many days has he been missing?" },
        { "urdu": "میں اس سوال کا جواب سوچ رہی ہوں", "english": "I have been thinking about the answer to this question." }
      ]
    },
    {
      "id": "present-perfect-continuous-advanced",
      "level": "advanced",
      "levelName": "Advanced",
      "description": "Complex continuous situations with visible results",
      "sentences": [
        { "urdu": "میں ساری رات جاگ رہی ہوں اس لیے بہت تھکی ہوئی ہوں", "english": "I have been awake all night, so I am very tired." },
        { "urdu": "تمہاری آنکھیں سرخ ہیں، کیا تم رو رہی تھی؟", "english": "Your eyes are red, have you been crying?" },
        { "urdu": "وہ پسینے میں بھیگا ہوا ہے، وہ دوڑ رہا ہوگا", "english": "He is drenched in sweat, he must have been running." },
        { "urdu": "مجھے لگتا ہے تم میری باتوں پر غور نہیں کر رہی", "english": "I feel like you have not been considering what I say." },
        { "urdu": "زمین گیلی ہے، یقیناً بارش ہو رہی ہوگی", "english": "The ground is wet, it must have been raining." },
        { "urdu": "وہ بہت خوش نظر آ رہی ہے، ضرور کچھ اچھا ہوا ہوگا", "english": "She looks very happy, something good must have been happening." },
        { "urdu": "میں نے دیکھا ہے کہ تم کافی عرصے سے پریشان ہو", "english": "I have noticed that you have been worried for quite some time." },
        { "urdu": "وہ بہت کمزور ہو گیا ہے، شاید ٹھیک سے نہیں کھا رہا", "english": "He has become very weak, perhaps he has not been eating properly." },
        { "urdu": "یہ مسئلہ کافی عرصے سے چل رہا ہے اور ابھی تک حل نہیں ہوا", "english": "This problem has been going on for a long time and has not been solved yet." },
        { "urdu": "میں محسوس کر رہی ہوں کہ وہ مجھ سے کچھ چھپا رہی ہے", "english": "I feel that she has been hiding something from me." },
        { "urdu": "تم بہت تھکی ہوئی لگ رہی ہو، کیا تم زیادہ کام کر رہی ہو؟", "english": "You look very tired, have you been working too much?" },
        { "urdu": "یہ پروجیکٹ کئی مہینوں سے چل رہا ہے مگر مکمل نہیں ہو رہا", "english": "This project has been running for several months but has not been completing." },
        { "urdu": "میں سوچ رہی ہوں کہ وہ کتنے عرصے سے جھوٹ بول رہا ہے", "english": "I am wondering how long he has been lying." },
        { "urdu": "ان کے تعلقات میں کافی عرصے سے تناؤ ہے", "english": "There has been tension in their relationship for quite some time." },
        { "urdu": "میں دیکھ رہی ہوں کہ تم پچھلے کچھ دنوں سے خاموش ہو", "english": "I see that you have been quiet for the past few days." },
        { "urdu": "یہ کمپنی کافی عرصے سے نقصان میں چل رہی ہے", "english": "This company has been running at a loss for quite some time." },
        { "urdu": "میں جاننا چاہتی ہوں کہ تم کیا سوچ رہی ہو", "english": "I want to know what you have been thinking." },
        { "urdu": "وہ کتابیں پھیلی ہوئی ہیں، وہ پڑھ رہی ہوگی", "english": "The books are scattered, she must have been reading." },
        { "urdu": "مجھے احساس ہے کہ میں بہت عرصے سے اپنی صحت کو نظرانداز کر رہی ہوں", "english": "I realize that I have been ignoring my health for a long time." },
        { "urdu": "یہ درخت سوکھ رہے ہیں، شاید پانی نہیں مل رہا", "english": "These trees are drying up, perhaps they have not been getting water." },
        { "urdu": "میں دیکھ رہی ہوں کہ وہ پچھلے کچھ عرصے سے بدل گیا ہے", "english": "I see that he has been changing over the past while." },
        { "urdu": "کافی عرصے سے محنت کر رہے ہیں اب نتیجہ ملنا چاہیے", "english": "We have been working hard for a long time, now we should get results." },
        { "urdu": "میں محسوس کر رہی ہوں کہ کچھ غلط ہو رہا ہے", "english": "I feel that something has been going wrong." },
        { "urdu": "یہ علاقہ کافی عرصے سے ترقی نہیں کر رہا", "english": "This area has not been developing for quite some time." },
        { "urdu": "وہ پریشان نظر آ رہی ہے، ضرور کچھ ہو رہا ہوگا", "english": "She looks worried, something must have been happening." },
        { "urdu": "میں خود سے سوال کر رہی ہوں کہ میں کیا کر رہی ہوں", "english": "I have been asking myself what I am doing." },
        { "urdu": "یہ مشین کافی دیر سے چل رہی ہے، اسے آرام دو", "english": "This machine has been running for a long time, give it a rest." },
        { "urdu": "میں محسوس کر رہی ہوں کہ وقت بہت تیزی سے گزر رہا ہے", "english": "I feel that time has been passing very quickly." },
        { "urdu": "وہ کہہ رہا ہے کہ وہ محنت کر رہا ہے مگر نتیجہ نظر نہیں آ رہا", "english": "He says he has been working hard but results are not showing." },
        { "urdu": "میں سوچ رہی ہوں کہ ہم اتنے عرصے سے کیا کر رہے ہیں", "english": "I have been thinking about what we have been doing all this time." }
      ]
    }
  ]
}
